create table pf_person(
key varchar2(6),
name varchar2(20),
photo varchar2(40),
startwork varchar2(40),
startyear varchar2(15),
birth varchar2(15),
works varchar2(4000)
);



insert into pf_person values(
'pf0001',
'한석규',
'persons/hansukkyu.jpg',
'닥터봉',
'1995년',
'1964-11-03(음)',
'닥터봉,엄마와 별과말미잘,은행나무 침대,초록물고기,넘버3,접속,8월의 크리스마스,쉬리,텔미썸딩'
);
commit;
 

insert into pf_person values(
'pf0002',
'이병헌',
'persons/leebyunghun.jpg',
'누가나를 미치게 하는가',
'1995년','1970-07-12(양)',
'누가 나를 미치게 하는가(1995,구임서감독)/런 어웨이(1995,김성수감독)/아마게돈(1996,이현세감독)/그들만의 세상(1996,임종재감독)/지상만가(1997,김희철감독)/내마음의 풍금(1999,이영재감독)/공동경비구역 JSA(2000,박찬욱감독)'
);
commit;
 

insert into pf_person values(
'pf0003',
'장동건',
'persons/jangdongkun.jpg',
'패자 부활전(이광훈감독)',
'1996년',
'1972-03-07(양)',
'패자 부활전(1997,이광훈감독)/홀리데이 인 서울(1997,김의석감독)/연풍연가(1999,박대영감독)/인정사정 볼 것 없다(1999,이명세감독)/아나키스트(2000,유영식감독)/친구(2001,곽경택감독)'
);
commit; 


insert into pf_person values(
'pf0004',
'송강호',
'persons/songkangho.gif',
'돼지가 우물에 빠진날',
'1995년',
'1967-01-17(음)',
'돼지가 우물에 빠진날(1995,홍상수감독)/초록물고기(1997,이창동감독)/NO.3(1997,송능한감독)/나쁜영화(1997,장선우감독)/조용한 가족(1998,김지운감독)/쉬리(1999,강제규감독)/반칙왕(2000,김지운감독)/공동경비구역 JSA(2000,박찬욱감독)'
);
commit; 


insert into pf_person values(
'pf0005',
'이영애',
'persons/leeyoungae.jpg',
'인샬라(96년)',
'1995년',
'71-01-31',
'인샬라(1996년),공동경비구역 JSA(2000년),선물(2000년),봄날은 간다(2001년)'
);
commit; 


insert into pf_person values(
'pf0006',
'유오성',
'persons/yuoseong.jpg',
'나는 소망한다 내게 금지된 것을',
'1994년',
'1968-09-11(음)',
'나는 소망한다 내게 금지된 것을(1994년 대종상 신인상 후보),닥터봉(1995년),맨(1995년),테러리스트(1995년),그들만의 세상(1996년),쁘아종(1997년),비트(1997년 청룡상 남우조연상 후보),토요일 오후2시(1998년),아름다운 시절(1998년),간첩리철진(1999년),주유소 습격사건(1999년),친구(2001년)'
);
commit; 


insert into pf_person values(
'pf0007',
'최민식',
'persons/choiminsick.jpg',
'구로 아리랑',
'1988년',
'1962-04-27(음)',
'구로 아리랑 (1989,박종원감독)/추락하는 것은 날개가 있다(1989,장길수감독)/우리들의 일그러진 영웅(1992,박종원감독)/우리사랑의 이대로(1992,강정수감독)/NO.3(1997,송능한감독)/조용한 가족(1998,김지운감독)/쉬리(1999,강제규감독)/해피엔드(1999,정지우감독),파이란(2001년)'
);
commit; 


insert into pf_person values(
'pf0008',
'강제규',
'persons/kangjekyu.jpg',
'은행나무 침대',
'1996년',
'1962-11-27(음)',
'됴화(1987,유지형감독)/그래 가끔은 하늘을 보자(1990,김성홍감독)/누가 용의 발톱을 보았는가(1991,강우석감독)/장미의 나날(1994,곽지균감독)/게임의 법칙(1994,장현수감독)/은행나무 침대(1996,강제규감독,박철민감독)/지상만가(1997,김희철감독)/쉬리(1999,강제규감독)'
);
commit; 


insert into pf_person values(
'pf0009',
'박찬욱',
'persons/parkchanuk.jpg',
'달은....해가 꾸는 꿈',
'1992년',
'1963-08-23',
'달은...해가 꾸는 꿈(1992,박찬욱감독)/삼인조(1997,박찬욱감독)/공동경비구역 JSA(2000,박찬욱감독)'
);
commit; 

insert into pf_person values(
'pf0010',
'곽경택',
'persons/no_photo.gif',
'억수탕',
' 1997년',
'정보 없음',
'친구 - 2001년, 닥터 K (Doctor K) - 1999년, 억수탕 - 1997년'
);
commit; 